brew "asdf"
brew "bat"
brew "btop"
brew "colima"
brew "curl"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "grep"
brew "grpcurl"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubectl"
brew "mkcert"
brew "neovim"
brew "ouch"
brew "pgcli"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "tmux"
brew "uv"
brew "yq"
brew "yt-dlp"
brew "zoxide"

# dependencies
brew "coreutils"
brew "delta"
brew "fd"
brew "findutils"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gawk"
brew "tree-sitter-cli"

tap "anomalyco/tap"
tap "koekeishiya/formulae"

brew "anomalyco/tap/opencode"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "dropbox"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "sol"
cask "trunk-io"
cask "visual-studio-code"
cask "wezterm"
cask "zen"
