brew "asdf"
brew "bat"
brew "coreutils"
brew "curl"
brew "delta"
brew "fd"
brew "ffmpeg"
brew "findutils"
brew "fish"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "grep"
brew "htop"
brew "jq"
brew "k3d"
brew "k9s"
brew "kubectl"
brew "neovim"
brew "pgcli"
brew "ripgrep"
brew "rsync"
brew "starship"
brew "terraform"
brew "tree-sitter-cli"
brew "tmux"
brew "wget"
brew "yq"
brew "yt-dlp"
brew "zoxide"

tap "koekeishiya/formulae"

brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

cask "bluestacks"
cask "font-ibm-plex"
cask "font-jetbrains-mono"
cask "google-chrome"
cask "rancher"
cask "raycast"
cask "spotify"
cask "visual-studio-code"
cask "wezterm"
cask "zen"
