anthropic.claude-code
ms-python.vscode-pylance
astro-build.astro-vscode
asvetliakov.vscode-neovim
blanu.vscode-styled-jsx
bmalehorn.vscode-fish
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc-icons
dbaeumer.vscode-eslint
eamodio.gitlens
esbenp.prettier-vscode
golang.go
ms-python.debugpy
ms-python.python
mvllow.rose-pine
unifiedjs.vscode-mdx
drblury.protobuf-vsc
